/*
 *	File：attack.h
 *	Make：HALTokyo AT-14A-275 Toshiki Chizo
 *	Outline：攻撃エフェクト処理クラス定義
 */

#pragma once
#ifndef _ATTACK_H_
#define _ATTACK_H_

/******************************************************************************/
/*                            インクルードファイル                            */
/******************************************************************************/
#include "Framework/2DAnimation.h"


/******************************************************************************/
/*                              ライブラリリンク                              */
/******************************************************************************/


/******************************************************************************/
/*                              マクロ＆定数定義                              */
/******************************************************************************/


/******************************************************************************/
/*                                 構造体定義                                 */
/******************************************************************************/


/******************************************************************************/
/*                                 クラス定義                                 */
/******************************************************************************/
class CEnemy;
class CAttack : public C2DAnimation {
	public:
		static CAttack *Create(CEnemy *pEnemy); // インスタンス生成
		virtual void Destroy(void);	         // インスタンス破棄
		void Update(void);					     // 更新処理
		bool Use(void){
			return m_bUse;
		}
		
		void Start(const Vec2 *pDefaultPos, int damage);// エフェクトスタート
			
	private:
		CAttack();						// コンストラクタ
		~CAttack(){};					// デストラクタ
		void Init(void);				// 初期化処理
	
		Vec2 m_start;					// 開始位置
		float m_fRot;					// 向き
		float m_fTime;					// 時間
		C2DAnimation *m_pHit;			// ヒットアニメーション
		bool m_bUse;					// 使用フラグ
		bool m_bHit;					// ヒットアニメーションフラグ
		int m_nDamage;                 // ダメージ量
		CEnemy *m_pEnemy;               // 敵
};


/******************************************************************************/
/*                              プロトタイプ宣言                              */
/******************************************************************************/


/******************************************************************************/

#endif