/*
 *	File：game.cpp
 *	Make：HALTokyo AT-14A-275 Toshiki Chizo
 *	Outline：ゲーム処理クラス実装
 */

/******************************************************************************/
/*                            インクルードファイル                            */
/******************************************************************************/
#include "game.h"
#include "Framework/2DSprite.h"
#include "Framework/MainManager.h"
#include "result.h"


/******************************************************************************/
/*                               静的変数初期化                               */
/******************************************************************************/


/******************************************************************************/
/*                                  定数定義                                  */
/******************************************************************************/


/******************************************************************************/
/*                               グローバル変数                               */
/******************************************************************************/


/******************************************************************************/
/*                                 クラス実装                                 */
/******************************************************************************/
//*************************************************
//					CGame クラス
//*************************************************
/*
 *	コンストラクタ
 */
CGame :: CGame(){
	
}

/*
 * クラス名：CGame
* 関数名：Init()
* 内容：初期化処理
*/
int CGame :: Init(void){
	Vec2 size(1280.0f, 720.0f);
	Vec2 pos(640.0f, 360.0f);
	m_pTestSprite = C2DSprite :: Create("game.img", &size, 1);
	m_pTestSprite->SetPosition(&pos);
	m_pTestSprite->LinkList(OBJECT_2D_UNKNOWN);
	return 0;
}

/*
 * クラス名：CGame
 * 関数名：Final()
 * 内容：終了処理
 */
void CGame :: Final(void){
	m_pTestSprite->Release();
}

/*
 * クラス名：CGame
 * 関数名：Update()
 * 内容：更新処理
 */
void CGame :: Update(void){
	const INPUT *pInput = CMainManager :: GetInput();

	if(pInput[0].flag == 1){
		CStateManager :: SetNextState(new CResult());
	}
}

/*
 * クラス名：CGame
 * 関数名：Pause()
 * 内容：中断処理
 */
void CGame :: Pause(void){
	
}

/*
 * クラス名：CGame
 * 関数名：Resume()
 * 内容：再開処理
 */
void CGame :: Resume(void){
	
}