/*
 *	File：score.cpp
 *	Make：HALTokyo AT-14A-275 Toshiki Chizo
 *	Outline：スコア処理クラス実装
 */

/******************************************************************************/
/*                            インクルードファイル                            */
/******************************************************************************/
#include "score.h"

/******************************************************************************/
/*                               静的変数初期化                               */
/******************************************************************************/


/******************************************************************************/
/*                                  定数定義                                  */
/******************************************************************************/


/******************************************************************************/
/*                               グローバル変数                               */
/******************************************************************************/


/******************************************************************************/
/*                                 クラス実装                                 */
/******************************************************************************/
//*************************************************
//					CScore クラス
//*************************************************
/*
 *	コンストラクタ
 */
CScore :: CScore():m_nScore(0),m_nDrawScore(0){
	
}

/*
 * クラス名：CScore
 * 関数名：Create()
 * 内容：インスタンス生成
 */
CScore *CScore :: Create(void){
	CScore *p = new CScore();
	
	Vec2 pos(52.0f, 635.0f);
	Vec2 size(30.0f, 75.0f);
	p->m_pScore = C2DNumber :: Create("game/number.img", &pos, &size, 28.0f, 4, 7, true, true);
	p->m_pScore->SetNumber(0);
	return p;
}

/*
 * クラス名：CScore
 * 関数名：Release()
 * 内容：インスタンス破棄
 */
void CScore :: Release(void){
	m_pScore->Release();
	delete this;
}

/*
 * クラス名：CScore
 * 関数名：Update()
 * 内容：更新処理
 */
void CScore :: Update(void){
	unsigned int dif = m_nScore - m_nDrawScore;

	if(dif >= 5000){
		m_nDrawScore += 100;
	} else if(dif >= 3000){
		m_nDrawScore += 57;
	} else if(dif >= 500){
		m_nDrawScore += 19;
	} else if(dif >= 100){
		m_nDrawScore += 3;
	} else if(dif >= 20){
		m_nDrawScore += 1;
	}

	m_pScore->SetNumber(m_nDrawScore);
}